OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic14/libdev/pic16f1773.c
__at(0x039F) __sfr IOCEF;
__at(0x039F) volatile __IOCEFbits_t IOCEFbits;

__at(0x040D) __sfr HIDRVB;
__at(0x040D) volatile __HIDRVBbits_t HIDRVBbits;

__at(0x040F) __sfr TMR5;

__at(0x040F) __sfr TMR5L;

__at(0x0410) __sfr TMR5H;

__at(0x0411) __sfr T5CON;
__at(0x0411) volatile __T5CONbits_t T5CONbits;

__at(0x0412) __sfr T5GCON;
__at(0x0412) volatile __T5GCONbits_t T5GCONbits;

__at(0x0413) __sfr T4TMR;

__at(0x0413) __sfr TMR4;

__at(0x0414) __sfr PR4;

__at(0x0414) __sfr T4PR;

__at(0x0415) __sfr T4CON;
__at(0x0415) volatile __T4CONbits_t T4CONbits;

__at(0x0416) __sfr T4HLT;
__at(0x0416) volatile __T4HLTbits_t T4HLTbits;

__at(0x0417) __sfr T4CLKCON;
__at(0x0417) volatile __T4CLKCONbits_t T4CLKCONbits;

__at(0x0418) __sfr T4RST;
__at(0x0418) volatile __T4RSTbits_t T4RSTbits;

__at(0x041A) __sfr T6TMR;

__at(0x041A) __sfr TMR6;

__at(0x041B) __sfr PR6;

__at(0x041B) __sfr T6PR;

__at(0x041C) __sfr T6CON;
__at(0x041C) volatile __T6CONbits_t T6CONbits;

__at(0x041D) __sfr T6HLT;
__at(0x041D) volatile __T6HLTbits_t T6HLTbits;

__at(0x041E) __sfr T6CLKCON;
__at(0x041E) volatile __T6CLKCONbits_t T6CLKCONbits;

__at(0x041F) __sfr T6RST;
__at(0x041F) volatile __T6RSTbits_t T6RSTbits;

__at(0x048E) __sfr ADRESL;

__at(0x048F) __sfr ADRESH;

__at(0x0490) __sfr ADCON0;
__at(0x0490) volatile __ADCON0bits_t ADCON0bits;

__at(0x0491) __sfr ADCON1;
__at(0x0491) volatile __ADCON1bits_t ADCON1bits;

__at(0x0492) __sfr ADCON2;

__at(0x0493) __sfr T2TMR;

__at(0x0493) __sfr TMR2;

__at(0x0494) __sfr PR2;

__at(0x0494) __sfr T2PR;

__at(0x0495) __sfr T2CON;
__at(0x0495) volatile __T2CONbits_t T2CONbits;

__at(0x0496) __sfr T2HLT;
__at(0x0496) volatile __T2HLTbits_t T2HLTbits;

__at(0x0497) __sfr T2CLKCON;
__at(0x0497) volatile __T2CLKCONbits_t T2CLKCONbits;

__at(0x0498) __sfr T2RST;
__at(0x0498) volatile __T2RSTbits_t T2RSTbits;

__at(0x049A) __sfr T8TMR;

__at(0x049A) __sfr TMR8;

__at(0x049B) __sfr PR8;

__at(0x049B) __sfr T8PR;

__at(0x049C) __sfr T8CON;
__at(0x049C) volatile __T8CONbits_t T8CONbits;

__at(0x049D) __sfr T8HLT;
__at(0x049D) volatile __T8HLTbits_t T8HLTbits;

__at(0x049E) __sfr T8CLKCON;
__at(0x049E) volatile __T8CLKCONbits_t T8CLKCONbits;

__at(0x049F) __sfr T8RST;
__at(0x049F) volatile __T8RSTbits_t T8RSTbits;

__at(0x050F) __sfr OPA1NCHS;

__at(0x0510) __sfr OPA1PCHS;

__at(0x0511) __sfr OPA1CON;
__at(0x0511) volatile __OPA1CONbits_t OPA1CONbits;

__at(0x0512) __sfr OPA1ORS;

__at(0x0513) __sfr OPA2NCHS;

__at(0x0514) __sfr OPA2PCHS;

__at(0x0515) __sfr OPA2CON;
__at(0x0515) volatile __OPA2CONbits_t OPA2CONbits;

__at(0x0516) __sfr OPA2ORS;

__at(0x0517) __sfr OPA3NCHS;

__at(0x0518) __sfr OPA3PCHS;

__at(0x0519) __sfr OPA3CON;
__at(0x0519) volatile __OPA3CONbits_t OPA3CONbits;

__at(0x051A) __sfr OPA3ORS;

__at(0x058D) __sfr DACLD;
__at(0x058D) volatile __DACLDbits_t DACLDbits;

__at(0x058E) __sfr DAC1CON0;
__at(0x058E) volatile __DAC1CON0bits_t DAC1CON0bits;

__at(0x058F) __sfr DAC1CON1;
__at(0x058F) volatile __DAC1CON1bits_t DAC1CON1bits;

__at(0x058F) __sfr DAC1REF;

__at(0x058F) __sfr DAC1REFL;
__at(0x058F) volatile __DAC1REFLbits_t DAC1REFLbits;

__at(0x0590) __sfr DAC1CON2;
__at(0x0590) volatile __DAC1CON2bits_t DAC1CON2bits;

__at(0x0590) __sfr DAC1REFH;
__at(0x0590) volatile __DAC1REFHbits_t DAC1REFHbits;

__at(0x0591) __sfr DAC2CON0;
__at(0x0591) volatile __DAC2CON0bits_t DAC2CON0bits;

__at(0x0592) __sfr DAC2CON1;
__at(0x0592) volatile __DAC2CON1bits_t DAC2CON1bits;

__at(0x0592) __sfr DAC2REF;

__at(0x0592) __sfr DAC2REFL;
__at(0x0592) volatile __DAC2REFLbits_t DAC2REFLbits;

__at(0x0593) __sfr DAC2CON2;
__at(0x0593) volatile __DAC2CON2bits_t DAC2CON2bits;

__at(0x0593) __sfr DAC2REFH;
__at(0x0593) volatile __DAC2REFHbits_t DAC2REFHbits;

__at(0x0594) __sfr DAC3CON0;
__at(0x0594) volatile __DAC3CON0bits_t DAC3CON0bits;

__at(0x0595) __sfr DAC3CON1;
__at(0x0595) volatile __DAC3CON1bits_t DAC3CON1bits;

__at(0x0595) __sfr DAC3REF;
__at(0x0595) volatile __DAC3REFbits_t DAC3REFbits;

__at(0x0596) __sfr DAC4CON0;
__at(0x0596) volatile __DAC4CON0bits_t DAC4CON0bits;

__at(0x0597) __sfr DAC4CON1;
__at(0x0597) volatile __DAC4CON1bits_t DAC4CON1bits;

__at(0x0597) __sfr DAC4REF;
__at(0x0597) volatile __DAC4REFbits_t DAC4REFbits;

__at(0x0598) __sfr DAC5CON0;
__at(0x0598) volatile __DAC5CON0bits_t DAC5CON0bits;

__at(0x0599) __sfr DAC5CON1;
__at(0x0599) volatile __DAC5CON1bits_t DAC5CON1bits;

__at(0x0599) __sfr DAC5REF;

__at(0x0599) __sfr DAC5REFL;
__at(0x0599) volatile __DAC5REFLbits_t DAC5REFLbits;

__at(0x059A) __sfr DAC5CON2;
__at(0x059A) volatile __DAC5CON2bits_t DAC5CON2bits;

__at(0x059A) __sfr DAC5REFH;
__at(0x059A) volatile __DAC5REFHbits_t DAC5REFHbits;

__at(0x059E) __sfr DAC7CON0;
__at(0x059E) volatile __DAC7CON0bits_t DAC7CON0bits;

__at(0x059F) __sfr DAC7CON1;
__at(0x059F) volatile __DAC7CON1bits_t DAC7CON1bits;

__at(0x059F) __sfr DAC7REF;
__at(0x059F) volatile __DAC7REFbits_t DAC7REFbits;

__at(0x0614) __sfr PWM3DCL;
__at(0x0614) volatile __PWM3DCLbits_t PWM3DCLbits;

__at(0x0615) __sfr PWM3DCH;
__at(0x0615) volatile __PWM3DCHbits_t PWM3DCHbits;

__at(0x0616) __sfr PWM3CON;
__at(0x0616) volatile __PWM3CONbits_t PWM3CONbits;

__at(0x0617) __sfr PWM4DCL;
__at(0x0617) volatile __PWM4DCLbits_t PWM4DCLbits;

__at(0x0618) __sfr PWM4DCH;
__at(0x0618) volatile __PWM4DCHbits_t PWM4DCHbits;

__at(0x0619) __sfr PWM4CON;
__at(0x0619) volatile __PWM4CONbits_t PWM4CONbits;

__at(0x061A) __sfr PWM9DCL;
__at(0x061A) volatile __PWM9DCLbits_t PWM9DCLbits;

__at(0x061B) __sfr PWM9DCH;
__at(0x061B) volatile __PWM9DCHbits_t PWM9DCHbits;

__at(0x061C) __sfr PWM9CON;
__at(0x061C) volatile __PWM9CONbits_t PWM9CONbits;

__at(0x068D) __sfr COG1PHR;
__at(0x068D) volatile __COG1PHRbits_t COG1PHRbits;

__at(0x068E) __sfr COG1PHF;
__at(0x068E) volatile __COG1PHFbits_t COG1PHFbits;

__at(0x068F) __sfr COG1BLKR;
__at(0x068F) volatile __COG1BLKRbits_t COG1BLKRbits;

__at(0x0690) __sfr COG1BLKF;
__at(0x0690) volatile __COG1BLKFbits_t COG1BLKFbits;

__at(0x0691) __sfr COG1DBR;
__at(0x0691) volatile __COG1DBRbits_t COG1DBRbits;

__at(0x0692) __sfr COG1DBF;
__at(0x0692) volatile __COG1DBFbits_t COG1DBFbits;

__at(0x0693) __sfr COG1CON0;
__at(0x0693) volatile __COG1CON0bits_t COG1CON0bits;

